# Homebrew dependencies for this shell setup.
# Install with: brew bundle --file=Brewfile  (run by install.sh)

# Prompt
brew "starship"

# Interactive shell plugins
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"

# Navigation / fuzzy finding
brew "fzf"
brew "zoxide"

# Modern CLI replacements
brew "git-delta"   # better git diffs
brew "eza"         # ls
brew "bat"         # cat
brew "fd"          # find
brew "ripgrep"     # grep

# Editor
brew "neovim"

# Terminal + font (font supplies the glyphs Starship's prompt uses)
cask "ghostty"
cask "font-lilex-nerd-font"

# Desktop apps
cask "alfred"   # Spotlight replacement
cask "dash"     # offline documentation browser
cask "claude"   # Anthropic's Claude desktop app
cask "shottr"   # screenshot + annotation tool
